Revit 2027 API
BendingDetailCustomFieldProperties.ParametersDisplayOption Property
 Identifies how the parameters will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailDisplayParametersOptions ParametersDisplayOption { get; set; }
Public Property ParametersDisplayOption As BendingDetailDisplayParametersOptions
	Get
	Set
public:
property BendingDetailDisplayParametersOptions ParametersDisplayOption {
	BendingDetailDisplayParametersOptions get ();
	void set (BendingDetailDisplayParametersOptions value);
}
member ParametersDisplayOption : BendingDetailDisplayParametersOptions with get, set
Property Value
BendingDetailDisplayParametersOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace